; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph0 - mode
	image1 - mode
	infrared3 - mode
	image2 - mode
	spectrograph4 - mode
	GroundStation7 - direction
	Star11 - direction
	Star2 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star8 - direction
	Star5 - direction
	Star9 - direction
	Star1 - direction
	GroundStation0 - direction
	Star4 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star8)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star8)
	(calibration_target instrument7 Star1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument8 thermograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 Star1)
	(supports instrument9 spectrograph4)
	(supports instrument9 infrared3)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 Star9)
	(supports instrument10 infrared3)
	(supports instrument10 image1)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation0)
	(calibration_target instrument10 Star1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
)
(:goal (and
	(pointing satellite3 Phenomenon15)
	(have_image Star12 image1)
	(have_image Phenomenon13 image2)
	(have_image Star14 image1)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 image2)
	(have_image Planet17 image2)
	(have_image Planet18 image1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 8
2. (calibrate satellite4 instrument10 star4)
   added: (calibrated instrument10)
   goals met: 0 of 8
3. (turn_to satellite4 star12 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star12)
   goals met: 0 of 8
4. (take_image satellite4 star12 instrument10 image1)
   added: (have_image star12 image1)
   goals met: 1 of 8
5. (turn_to satellite4 planet18 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 planet18)
   goals met: 1 of 8
6. (turn_to satellite1 groundstation0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 8
7. (take_image satellite4 planet18 instrument10 image1)
   added: (have_image planet18 image1)
   goals met: 2 of 8
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 8
9. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 2 of 8
10. (turn_to satellite1 phenomenon13 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 8
11. (take_image satellite1 phenomenon13 instrument2 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 8
12. (turn_to satellite1 phenomenon15 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 8
13. (take_image satellite1 phenomenon15 instrument2 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 4 of 8
14. (turn_to satellite1 planet17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet17)
   goals met: 4 of 8
15. (take_image satellite1 planet17 instrument2 image2)
   added: (have_image planet17 image2)
   goals met: 5 of 8
16. (turn_to satellite1 star16 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star16)
   goals met: 5 of 8
17. (take_image satellite1 star16 instrument2 image2)
   added: (have_image star16 image2)
   goals met: 6 of 8
18. (turn_to satellite3 phenomenon15 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 phenomenon15)
   goals met: 7 of 8
19. (turn_to satellite4 star14 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 star14)
   goals met: 7 of 8
20. (take_image satellite4 star14 instrument10 image1)
   added: (have_image star14 image1)
   goals met: 8 of 8
